## Title  :- Pandas Practice
### Name  :- Owais Ur Rehman
### Email :- owaisurrehmands@gmail.com

In [54]:
# import the useful Libraries
import pandas as pd
import numpy as np

In [55]:
# Make a series in pandas
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [56]:
type(s)

pandas.core.series.Series

In [57]:
# Create dataframe by by passing a NumPy array with a datetime index using date_range() and labeled columns
dates = pd.date_range("20240101", periods=10)
dates

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10'],
              dtype='datetime64[ns]', freq='D')

In [58]:
# Creating a dataframe which will be in the shape of rows and column
df = pd.DataFrame(np.random.randn(10, 3), index=dates, columns=list("XYZ"))
df

                   X         Y         Z
2024-01-01  1.361311  1.075065 -0.592487
2024-01-02  1.112171 -0.106610 -0.127734
2024-01-03  0.817714 -1.857772  0.476171
2024-01-04  0.375062  0.096868  0.407621
2024-01-05  1.799616  0.321126 -0.643885
2024-01-06  0.417868  1.802403 -1.495868
2024-01-07  0.260665  0.893740  0.089957
2024-01-08  1.447157  0.560891 -0.907168
2024-01-09  1.740238 -0.271556  1.062968
2024-01-10 -0.859075 -1.581124  0.742725

In [59]:
df.head()

                   X         Y         Z
2024-01-01  1.361311  1.075065 -0.592487
2024-01-02  1.112171 -0.106610 -0.127734
2024-01-03  0.817714 -1.857772  0.476171
2024-01-04  0.375062  0.096868  0.407621
2024-01-05  1.799616  0.321126 -0.643885

In [60]:
df.tail()

                   X         Y         Z
2024-01-06  0.417868  1.802403 -1.495868
2024-01-07  0.260665  0.893740  0.089957
2024-01-08  1.447157  0.560891 -0.907168
2024-01-09  1.740238 -0.271556  1.062968
2024-01-10 -0.859075 -1.581124  0.742725

In [61]:
df.describe()

               X          Y          Z
count  10.000000  10.000000  10.000000
mean    0.847273   0.093303  -0.098770
std     0.820744   1.134295   0.804673
min    -0.859075  -1.857772  -1.495868
25%     0.385763  -0.230320  -0.631035
50%     0.964942   0.208997  -0.018888
75%     1.425696   0.810528   0.459033
max     1.799616   1.802403   1.062968

In [62]:
# Dataframe by passing a dictionary of objects where the keys are the column labels and the values are the column values.
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [63]:
# Display the data_type of all column
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

## Viewing Data

In [64]:
df.to_numpy()

array([[ 1.36131097,  1.07506525, -0.59248654],
       [ 1.11217101, -0.1066104 , -0.12773415],
       [ 0.81771378, -1.85777157,  0.47617079],
       [ 0.37506178,  0.09686761,  0.40762078],
       [ 1.79961571,  0.32112638, -0.64388501],
       [ 0.41786799,  1.80240251, -1.49586849],
       [ 0.26066466,  0.89374041,  0.08995716],
       [ 1.44715732,  0.56089097, -0.90716755],
       [ 1.74023833, -0.27155629,  1.06296804],
       [-0.85907515, -1.58112394,  0.74272532]])

In [65]:
df[0:3]

                   X         Y         Z
2024-01-01  1.361311  1.075065 -0.592487
2024-01-02  1.112171 -0.106610 -0.127734
2024-01-03  0.817714 -1.857772  0.476171

In [66]:
# Make the transpose of the dataset
df.T

,2024-01-01,2024-01-02,2024-01-03,2024-01-04,2024-01-05,2024-01-06,2024-01-07,2024-01-08,2024-01-09,2024-01-10
X,1.361311,1.112171,0.817714,0.375062,1.799616,0.417868,0.260665,1.447157,1.740238,-0.859075
Y,1.075065,-0.106610,-1.857772,0.096868,0.321126,1.802403,0.893740,0.560891,-0.271556,-1.581124
Z,-0.592487,-0.127734,0.476171,0.407621,-0.643885,-1.495868,0.089957,-0.907168,1.062968,0.742725

In [67]:
# This code will sort the data in ascending or decending order
# 1- First sort in ascending order
df.sort_index()

                   X         Y         Z
2024-01-01  1.361311  1.075065 -0.592487
2024-01-02  1.112171 -0.106610 -0.127734
2024-01-03  0.817714 -1.857772  0.476171
2024-01-04  0.375062  0.096868  0.407621
2024-01-05  1.799616  0.321126 -0.643885
2024-01-06  0.417868  1.802403 -1.495868
2024-01-07  0.260665  0.893740  0.089957
2024-01-08  1.447157  0.560891 -0.907168
2024-01-09  1.740238 -0.271556  1.062968
2024-01-10 -0.859075 -1.581124  0.742725

In [68]:
# Sorting aganist the columns
df.sort_index(axis=1)

                   X         Y         Z
2024-01-01  1.361311  1.075065 -0.592487
2024-01-02  1.112171 -0.106610 -0.127734
2024-01-03  0.817714 -1.857772  0.476171
2024-01-04  0.375062  0.096868  0.407621
2024-01-05  1.799616  0.321126 -0.643885
2024-01-06  0.417868  1.802403 -1.495868
2024-01-07  0.260665  0.893740  0.089957
2024-01-08  1.447157  0.560891 -0.907168
2024-01-09  1.740238 -0.271556  1.062968
2024-01-10 -0.859075 -1.581124  0.742725

In [69]:
# Sortnig by values
sbv= pd.DataFrame({
     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
     'col2': [2, 1, 9, 8, 7, 4],
     'col3': [0, 1, 9, 4, 2, 3],
     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
 })
sbv

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [70]:
# Now sort the values of column
sbv.sort_values(['col1'])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [71]:
# We can sort with multiple columns as well
sbv.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

> #### Shown the difference between loc vs iloc

In [72]:
df_loc = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
 index=['cobra', 'viper', 'sidewinder'],
 columns=['max_speed', 'shield'])
df_loc

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [73]:
df_loc.loc['viper']
# This code return the row as series

max_speed    4
shield       5
Name: viper, dtype: int64

In [74]:
# This will display the data based on the index ranging from 0.....n
df_loc.iloc[2]

max_speed    7
shield       8
Name: sidewinder, dtype: int64

In [75]:
# That code will return the dataframe
df_loc.loc[['cobra','sidewinder']]

            max_speed  shield
cobra               1       2
sidewinder          7       8

In [76]:
# Single label for row and column
df_loc.loc['sidewinder','max_speed']

np.int64(7)

In [77]:
# By using Boolean data type this can be done like this
df_loc.loc[[False, False, True]]
# The first two rows are false that's why the are not printed

            max_speed  shield
sidewinder          7       8

In [78]:
""" This will return the conditional data i.e weather the mention field has data maximum than 6"""
df_loc.loc[df_loc['shield']>2]

            max_speed  shield
viper               4       5
sidewinder          7       8

In [93]:
# Multiple conditional using & that returns a boolean Series (LOGICAL OPERATORS)
df_loc.loc[(df_loc['max_speed'] > 0) & (df_loc['shield'] < 0)]

Empty DataFrame
Columns: [max_speed, shield]
Index: []

#### Setting values

Set value for all items matching the list of labels

In [80]:
# displaying the old dataset
df_loc

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [81]:
df_loc.loc[['viper', 'sidewinder'], ['shield']] = 100
# Updated Dataframe
df_loc

            max_speed  shield
cobra               1       2
viper               4     100
sidewinder          7     100

In [82]:
# Set value for an entire row
df_loc.loc['cobra']=30
df_loc

            max_speed  shield
cobra              30      30
viper               4     100
sidewinder          7     100

In [83]:
# Setting value for an entire column e.g max_speed column will be updated
df_loc.loc[:,'max_speed']=197
df_loc

            max_speed  shield
cobra             197      30
viper             197     100
sidewinder        197     100

In [84]:
# Setting using a Series or a DataFrame sets the values matching the index labels, not the index positions.
shuffled_df = df_loc.loc[["viper", "cobra", "sidewinder"]]
df_loc.loc[:] += shuffled_df
df_loc

            max_speed  shield
cobra             394      60
viper             394     200
sidewinder        394     200

### Boolean Indexing

In [85]:
df_booleanindexing = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df_booleanindexing

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [86]:
df_booleanindexing["E"] = ["one", "one", "two", "three"]
df_booleanindexing

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3    one  foo
1  1.0 2013-01-02  1.0  3    one  foo
2  1.0 2013-01-02  1.0  3    two  foo
3  1.0 2013-01-02  1.0  3  three  foo

## Missing Indexing
Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data

In [87]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1],"E"] = 2
df1

                   X         Y         Z    E
2024-01-01  1.361311  1.075065 -0.592487  2.0
2024-01-02  1.112171 -0.106610 -0.127734  2.0
2024-01-03  0.817714 -1.857772  0.476171  NaN
2024-01-04  0.375062  0.096868  0.407621  NaN

In [88]:
# To Check the sum of the cells each column that is empty
df1.isnull().sum()
# The output shows that the column E has two empty values

X    0
Y    0
Z    0
E    2
dtype: int64

In [89]:
# We can drop the null values by this code
df1.fillna(value="xyz")
df1

                   X         Y         Z    E
2024-01-01  1.361311  1.075065 -0.592487  2.0
2024-01-02  1.112171 -0.106610 -0.127734  2.0
2024-01-03  0.817714 -1.857772  0.476171  NaN
2024-01-04  0.375062  0.096868  0.407621  NaN